import React from 'react';
import css from './RulesPopup.module.css';

const RulesPopup = ({ onAccept, onDecline }) => {
    const handleClosePopup = (e) => {
        if (e.target.id === 'popup-overlay') {
            onDecline();
        }
    };

    return (
        <div
            id="popup-overlay"
            className={css.popupOverlay}
            onClick={handleClosePopup}
        >
            <div className={css.popupContent} onClick={(e) => e.stopPropagation()}>
                <h2>Правила Групи</h2>
                <p>
                    Ці правила розроблені Адміністрацією та обов’язкові до дотримання.
                </p>
                <hr />
                <ol>
                    <li>Не суперечти адміністрації.<br />
                        Обговорення дій адміністрації, суперечки з нею, образи адресовані
                        Адміністрації або обговорення правил групи караються БАНом без попередження.</li>
                    <li>Не флуди.<br />
                        Засмічення групи (додавання повторних фото, тем, посилань на сумнівні джерела,
                        аудіозаписів, відеозаписів, беззмістовних чи однотипних повідомлень, тролінг тощо)
                        карається попередженням, при рецидиві – БАН.
                    </li>
                    <li>Не вживай нецензурну лексику.<br />
                        Неповажні висловлювання, наклеп, хамство, лайка, образи на будь-якому ґрунті,
                        а також файли, створені вами з образливим змістом, караються БАНом без попередження.
                    </li>
                    <li>Не рекламуй.<br />
                        Спам, прохання додатись до інших груп, реклама товарів або сторінок караються БАНом без попередження.
                    </li>
                </ol>
                <hr />
                <p>
                    Адміністрація залишає за собою право змінювати ці правила.
                    Якщо ви не погоджуєтесь із нашою політикою конфіденційності, ви можете відмовитися від використання
                    нашого сервісу.
                </p>
                <div className={css.popupButtons}>
                    <button onClick={onAccept} className={css.acceptButton}>Прийняти</button>
                </div>
            </div>
        </div>
    );
};

export default RulesPopup;
